	//---------------------------------
// 2007/04/05 이강형
//---------------------------------
// Char-Item.cpp 에서 사용하는
// 확률 데이터 모음
//---------------------------------
#ifndef _CHARITEM_H
#define _CHARITEM_H

#define MAX_BOX_OUTPUT 2

// 말종류와 범위 : 최대범위 1000
// 나머지는 갈색마가 선택된다.

// 대만에서만 흑마,백마,갈색마가 나오게한다. (PCK - 2007.09.11)
// 추가 - 얼룩마도 나오게 추가한다 (PCK - 2007.10.24)
#ifdef _TAIWAN
const cltUniqueRange ItemUnique_5600_SmallMedal[] = 
{
	{	HORSEUNIQUE_BLACK,		30	}	// < 3		흑마
	,{	HORSEUNIQUE_WHITE,		20	}	// < 5		백마
	,{  HORSEUNIQUE_ZEBRA,		10  }	// < 6		얼룩마
	,{	HORSEUNIQUE_THOUSAND,	10  }	// < 7		천리마
};
#else

const cltUniqueRange ItemUnique_5600_SmallMedal[] = 
{
	{	HORSEUNIQUE_BLACK,		30	}	// < 30		흑마
	,{	HORSEUNIQUE_WHITE,		20	}	// < 50		백마
	,{	HORSEUNIQUE_ZEBRA,		10	}	// < 60		얼룩마
	,{	HORSEUNIQUE_THOUSAND,	10	}	// < 70		천리마
	,{	HORSEUNIQUE_RED,		10	}	// < 80		적토마
	,{	HORSEUNIQUE_STEEL,		10	}	// < 90		철기마
};
#endif

const cltUniqueRange ItemUnique_13057_Treasure[] =
{
	{	0,		55	}	// 일반 몬스터
	,{	1,		40	}	// 일반 유령
	,{  2,		5  }	// 영웅 유령
};

// ItemUnique(7925)에서 나오는 아이템 : 최대범위 100
const cltUniqueRange ItemUnique_7925_ItemUnque[] = 
{
	{	ITEMUNIQUE(2630),		30	}	// < 30
	,{	ITEMUNIQUE(3875),		10	}	// < 40
	,{	ITEMUNIQUE(7860),		10	}	// < 50
	,{	ITEMUNIQUE(3855),		10	}	// < 60
	,{	ITEMUNIQUE(3865),		10	}	// < 70
	,{	ITEMUNIQUE(2710),		5	}	// < 75
	,{	ITEMUNIQUE(2725),		5	}	// < 80
	,{	ITEMUNIQUE(2674),		5	}	// < 85
	,{	ITEMUNIQUE(2672),		5	}	// < 90
	,{	ITEMUNIQUE(2695),		5	}	// < 95
	,{	ITEMUNIQUE(24000),		5	}	// < 100
};

// ItemUnique(7970)에서 나오는 아이템 : 최대범위 100
const cltUniqueRange ItemUnique_7970_ItemUnque[] = 
{
	{	ITEMUNIQUE(5600),		2	}	// < 2
	,{	ITEMUNIQUE(13606),		8	}	// < 10
	,{	ITEMUNIQUE(24047),		20	}	// < 30
	,{	ITEMUNIQUE(24000),		10	}	// < 40
	,{	ITEMUNIQUE(2730),		10	}	// < 50
	,{	ITEMUNIQUE(7860),		10	}	// < 60
	,{	ITEMUNIQUE(24075),		10	}	// < 70
	,{	ITEMUNIQUE(24045),		10	}	// < 80
	,{	ITEMUNIQUE(3860),		10	}	// < 90
	,{	ITEMUNIQUE(3865),		10	}	// < 100
};

// ItemUnique(7970)에서 나오는 아이템의 개수 : 최대범위 100
const cltUniqueRange ItemUnique_7970_ItemNum[] = 
{
	{	1,		70	}	// < 70
	,{	2,		20	}	// < 90
	,{	3,		10	}	// < 100
};

//[추가 : 보스 와일드 보어 이벤트 아이템 송편, 황진성 2007.9.18]
const cltUniqueRange ItemUnique_3730_ItemNum[] = 
{
	{	5620,		4	}	// < 4
	,{	24040,		4	}	// < 8
	,{	15900,		4	}	// < 12
	,{	18110,		4	}	// < 16// 아레스 스피릿이 들어가 있어서 빨간망토로 수정 
	,{	2575,		30	}	// < 46
	,{	2580,		20	}	// < 66
	,{	24015,		20	}	// < 86
	,{	24000,		14	}	// < 100
};

//[추가 : 황진성 2007. 11. 29. 크리스마스 양말 아이템 까면 나오는 아이템]
//[김영훈 수정:2001.11.30 - 드롭아이템 유니크 번호 수정]
const cltUniqueRange ItemUnique_13002_ItemNum[] = 
{
	{	24094,		 100	}	// < 10
	,{	24123,		 100	}	// < 20
	,{	2765,		 10		}	// < 21
	,{	18161,		 5		}	// < 21.5
	,{	23581,		 5		}	// < 22
	,{	2756,		 20		}	// < 24
	,{	3897,		 50		}	// < 29
	,{	3928,		 50		}	// < 34
	,{	7865,		 150	}	// < 49
	,{	3915,		 250	}	// < 74
	,{	24082,		 130	}	// < 87
	,{	24045,		 130	}	// < 100
};

//[추가 : 황진성 2007. 12. 11 행운상자 까면 나오는 아이템.]
const cltUniqueRange ItemUnique_13303_ItemNum[] = 
{
	{  5600, 1 }	,{  2725, 1 }	,{ 24020, 1 }   ,{ 24075, 1 }	,{ 24000, 1 }	
	,{  5380, 3 }	,{  7175, 3 }	,{  6140, 3 }	,{  5000, 3 }	,{  5010, 3 }	
	,{  5020, 3 }	,{  5030, 3 }	,{  5040, 3 }	,{  5050, 3 }	,{  5056, 3 }	
	,{  5057, 3 }	,{  5060, 3 }	,{  5065, 3 }	,{  5070, 3 }	,{  5075, 3 }	
	,{  5080, 3 }	,{  5090, 3 }	,{  5100, 3 }	,{  5200, 3 }	,{  6050, 3 }	
	,{  6100, 3 }	,{  6105, 3 }	,{  6110, 3 }	,{  6115, 2 }	,{  6120, 2 }	
	,{  7000, 2 }	,{  7010, 2 }	,{  7020, 2 }	,{  7040, 2 }	,{  7050, 2 }	
	,{  7060, 2 }   ,{  7070, 2 }	,{  7080, 2 }	,{  7090, 2 }	,{  7100, 4 }
};

const cltValuesRange  ItemValue_13316_ItemNumUSA_KOR[] = 
{
	// 퍼센트,		유니크,		개수,		기간.
	{   5,		23530,			1,		15 }	
	,{   5,		23520,			1,		15 }	
	,{   5,		18190,			1,		15 }	
	,{   5,		18150,			1,		15 }	
	,{   5,		18140,			1,		15 }
	,{   5,		23090,			1,		15 }	
	,{	 5,		23050,			1,		15 }	
	,{	15,		15900,			1,		15 }	
	,{  10,		5600,			1,		 0 }	
	,{  50,		3875,			1,		 0 }	
	,{ 200,		3770,			1,		 0 }	
	,{ 100,		3800,			1,		 0 }	
	,{  50,		2672,			1,		 0 }	
	,{ 180,		5045,			5,		 0 }
	,{ 180,		5055,			5,		 0 }	
	,{ 180,		5015,			5,		 0 }
};

// [춘기] 남성용, 여성용 신년 행운상자 내용 구분 (08.11.13)
// 남성용 신년 행운상자
const cltValuesRange  ItemValue_13316WithMan_ItemNum[] = 
{
	// 퍼센트,		유니크,		개수,		기간.
	{   5,		18190,			1,		3  }	
	,{   6,		18110,			1,		3  }	
	,{   5,		23090,			1,		3  }	
	,{	 3,		23098,			1,		3  }		// 남성용 마법사모자
	,{	 3,		23715,			1,		3  }		// 남성용 마법사의복
	,{	 3,		23101,			1,		3  }		// 남성용 신년한복모자
	,{	 3,		23716,			1,		3  }		// 남성용 신년한복
	,{	 3,		23105,			1,		3  }		// 남성용 치파오 모자
	,{	 5,		23720,			1,		3  }		// 남성용 치파오 의복
	,{	 3,		23110,			1,		3  }	
	,{   3,		23728,			1,		3  }	
	,{   3,		23020,			1,		3  }
	,{   3,		23520,			1,		3  }	
	,{   3,		23080,			1,		3  }	
	,{   3,		23600,			1,		3  }	
	,{   3,		23015,			1,		3  }
	,{   3,		23515,			1,		3  }	
	,{  310,	3770,			1,		0  }
	,{  310,	3800,			1,		0  }
	,{   80,	2672,			1,		0  }
	,{   80,	5045,			5,		0  }
	,{   80,	5055,			5,		0  }
	,{   80,	5015,			5,		0  }
};

// 여성용 신년 행운상자
const cltValuesRange  ItemValue_13316WithWoman_ItemNum[] = 
{
	// 퍼센트,		유니크,		개수,		기간.
	{    5,		18190,			1,		3  }	
	,{   6,		18110,			1,		3  }	
	,{   5,		23090,			1,		3  }	
	,{	 3,		23100,			1,		3  }		// 여성용 마법사모자
	,{	 3,		23712,			1,		3  }		// 여성용 마법사의복
	,{	 3,		23102,			1,		3  }		// 여성용 신년한복모자
	,{	 3,		23717,			1,		3  }		// 여성용 신년한복
	,{	 3,		23107,			1,		3  }		// 여성용 치파오 모자
	,{	 5,		23725,			1,		3  }		// 여성용 치파오 의복
	,{	 3,		23110,			1,		3  }	
	,{   3,		23728,			1,		3  }	
	,{   3,		23020,			1,		3  }
	,{   3,		23520,			1,		3  }	
	,{   3,		23080,			1,		3  }	
	,{   3,		23600,			1,		3  }	
	,{   3,		23015,			1,		3  }
	,{   3,		23515,			1,		3  }	
	,{  310,	3770,			1,		0  }
	,{  310,	3800,			1,		0  }
	,{   80,	2672,			1,		0  }
	,{   80,	5045,			5,		0  }
	,{   80,	5055,			5,		0  }
	,{   80,	5015,			5,		0  }
};


// 추가 : 일본용 신년 행운상자 (남성용) (08.12.18)
const cltValuesRange  ItemValue_13316WithManJapan_ItemNum[] = 
{
	// 퍼센트,		유니크,		개수,		기간.
	{   5,		18190,			1,		3  }	
	,{   6,		18110,			1,		3  }	
	,{   5,		23090,			1,		3  }	
	,{	 3,		23098,			1,		3  }		// 남성용 마법사모자
	,{	 3,		23715,			1,		3  }		// 남성용 마법사의복
	,{	 3,		23070,			1,		3  }		// 빗세트 (남녀공용)
	,{	 3,		23590,			1,		3  }		// 남성용 일본신년의복
	,{	 3,		23105,			1,		3  }		// 남성용 치파오 모자
	,{	 5,		23720,			1,		3  }		// 남성용 치파오 의복
	,{	 3,		23110,			1,		3  }	
	,{   3,		23728,			1,		3  }	
	,{   3,		23020,			1,		3  }
	,{   3,		23520,			1,		3  }	
	,{   3,		23080,			1,		3  }	
	,{   3,		23600,			1,		3  }	
	,{   3,		23015,			1,		3  }
	,{   3,		23515,			1,		3  }	
	,{  310,	3770,			1,		0  }
	,{  310,	3800,			1,		0  }
	,{   80,	2672,			1,		0  }
	,{   80,	5045,			5,		0  }
	,{   80,	5055,			5,		0  }
	,{   80,	5015,			5,		0  }
};

// 추가 : 일본용 신년 행운상자 (여성용) (08.12.18)
const cltValuesRange  ItemValue_13316WithWomanJapan_ItemNum[] = 
{
	// 퍼센트,		유니크,		개수,		기간.
	{    5,		18190,			1,		3  }	
	,{   6,		18110,			1,		3  }	
	,{   5,		23090,			1,		3  }	
	,{	 3,		23100,			1,		3  }		// 여성용 마법사모자
	,{	 3,		23712,			1,		3  }		// 여성용 마법사의복
	,{	 3,		23070,			1,		3  }		// 빗세트 (남녀공용)
	,{	 3,		23585,			1,		3  }		// 여성용 일본신년의복
	,{	 3,		23107,			1,		3  }		// 여성용 치파오 모자
	,{	 5,		23725,			1,		3  }		// 여성용 치파오 의복
	,{	 3,		23110,			1,		3  }	
	,{   3,		23728,			1,		3  }	
	,{   3,		23020,			1,		3  }
	,{   3,		23520,			1,		3  }	
	,{   3,		23080,			1,		3  }	
	,{   3,		23600,			1,		3  }	
	,{   3,		23015,			1,		3  }
	,{   3,		23515,			1,		3  }	
	,{  310,	3770,			1,		0  }
	,{  310,	3800,			1,		0  }
	,{   80,	2672,			1,		0  }
	,{   80,	5045,			5,		0  }
	,{   80,	5055,			5,		0  }
	,{   80,	5015,			5,		0  }
};

// [영훈] 신년 복주머니(대만전용) 2008.01.22
const cltValuesRange  ItemValue_8120_ItemNumTaiwan[] = 
{
	// 퍼센트,		유니크,		개수,		기간.
	{  5,		24102,			1,		0}	// 순간이동이용권(영구)
	,{  10,		24030,			1,		0}	// 상태초기화이용권
	,{  20,		5370,			20,		0}	// 축복의돌
	,{ 100,		5370,			10,		0}	// 축복의돌
	,{  20,		5350,			20,		0}	// 불속성석
	,{ 100,		5350,			10,		0}	// 불속성석
	,{  20,		5355,			20,		0}	// 물속성석
	,{ 100,		5355,			10,		0}	// 물속성석
	,{  20,		5360,			20,		0}	// 바람속성석
	,{ 100,		5360,			10,		0}	// 바람속성석
	,{  20,		5365,			20,		0}	// 땅속성석
	,{ 100,		5365,			10,		0}	// 땅속성석
	,{  30,		5400,			5,		0}	// 영혼의돌
	,{ 110,		5400,			3,		0}	// 영혼의돌
	,{ 110,		13606,			25,		0}	// 인첸트 망치
	,{  10,		13607,			10,		0}	// 인첸트 못
	,{ 110,		13607,			3,		0}	// 인첸트 못
	,{  15,		5600,			1,		0}	// 작은메달

};

// [성웅] 2차 복주머니 2008.06.30
const cltValuesRange  ItemValue_13331_ItemNum[] = 
{
	// 퍼센트,		유니크,		개수,		기간.
	{	100,		5695,			1,		0}	// 늑대 메달
	,{	100,		13300,			1,		0}	// 제갈공명 의복 상자
	,{	100,		13305,			1,		0}	// 고양이 방석 상자
	,{	100,		13306,			1,		0}	// 메이드 의복 상자
	,{	100,		13313,			1,		0}	// 그리스 의복 상자
	,{	100,		5690,			1,		0}	// 호랑이 메달
	,{	100,		13322,			1,		0}	// 강아지 방석 상자
	,{	100,		13317,			1,		0}	// 닌자 변신 스피릿
	,{	100,		5685,			1,		0}	// 낙타 메달
	,{	100,		13320,			1,		0}	// 해적 의복

};
// [성웅] 2차 복주머니 추가 아이템 선택 
const cltValuesRange  ItemValue_1333_ItemNum_Extra[] = 
{
	// 퍼센트,		유니크,		개수,		기간.
	{	10,			2759,			1,		0}	// EXP캡슐 
	,{	15,			24030,			1,		0}	// 상태 초기화 이용권
	,{	10,			24070,			1,		0}	// 케릭터 변경 이용권
	,{	20,			2740,			1,		0}	// 마법의 탈 것 강화제
	,{	10,			24096,			1,		0}	// 순간이동 정기권
	,{	20,			2757,			1,		0}	// EXP 캡슐
	,{	20,			24099,			1,		0}	// 시장 프리미엄 이용권
	,{	60,			7860,			10,		0}	// 이상한 소환 알
	,{	30,			5410,			1,		0}	// 스피릿 결정
	,{	70,			24075,			5,		0}	// 프리미엄 개인 이용권
	,{	70,			3897,			1,		0}	// 히시모찌
	,{	100,		2725,			10,		0}	// 선공 방지 스프
	,{	100,		24000,			5,		0}	// 워프 티켓
	,{	100,		2730,			3,		0}	// 부활의 약
	,{	120,		24040,			1,		0}	// 기술 부분 초기화 이용권
	,{	120,		24020,			1,		0}	// 소환수 부활의 돌
	,{	120,		24047,			1,		0}	// 자막 고백 이용권
	,{	5,			12506,			1,		0}	// 탄광 소녀 소환 인형

};

// [춘기] 3차 복주머니 (2009.11.26)
const cltValuesRange	ItemValue_13359_ItemNum[] = 
{
	// 퍼센트,		유니크,		개수,		기간.
	{	100,		12515,			1,		0}	// 슈퍼탱이
	,{	100,		5740,			1,		0}	// 코끼리 메달
	,{	100,		13336,			1,		0}	// 담요상자
	,{	100,		13338,			1,		0}	// 크리스마스 스피릿 상자
	,{	100,		5749,			1,		0}	// 불해치 메달
	,{	100,		13341,			1,		0}	// 불량학생 의복 상자
	,{	100,		12533,			1,		0}	// 워터프린세스 소환수
	,{	100,		13343,			1,		0}	// 투사 스피릿 상자
	,{	100,		13346,			1,		0}	// 결혼 예복 상자
	,{	100,		13350,			1,		0}	// 잠자는 냐옹이 상자
	,{	100,		13651,			1,		0}	// 불의 정령
	,{	100,		13352,			1,		0}	// 요정스피릿 상자
};

// [춘기] 3차 복주머니 추가 아이템 (2009.11.26)
const cltValuesRange  ItemValue_13359_ItemNum_Extra[] = 
{
	// 퍼센트,		유니크,		개수,		기간.
	{	100,			2759,			1,		0}	// EXP캡슐 
	,{	150,			24030,			1,		0}	// 상태 초기화 이용권
	,{	100,			24070,			1,		0}	// 케릭터 변경 이용권
	,{	200,			2740,			1,		0}	// 마법의 탈 것 강화제
	,{	100,			24096,			1,		0}	// 순간이동 정기권
	,{	200,			2757,			1,		0}	// EXP 캡슐
	,{	200,			24099,			1,		0}	// 시장 프리미엄 이용권
	,{	600,			7860,			10,		0}	// 이상한 소환 알
	,{	300,			5410,			1,		0}	// 스피릿 결정
	,{	700,			24075,			5,		0}	// 프리미엄 개인 이용권
	,{	700,			3897,			1,		0}	// 히시모찌
	,{	1000,			2725,			5,		0}	// 선공 방지 스프
	,{	1000,			24000,			10,		0}	// 워프 티켓
	,{	1000,			2730,			5,		0}	// 부활의 약
	,{	1200,			24040,			10,		0}	// 기술 부분 초기화 이용권
	,{	1200,			24020,			5,		0}	// 소환수 부활의 돌
	,{	1200,			24047,			10,		0}	// 자막 고백 이용권
	,{	49,				15917,			1,		30}	// 작은 라쿤 가방 (30일)
	,{	1,				15918,			1,		365}	// 라쿤 가방 (365일)
};

// [영훈] 발렌타인 과금 아이템 - 초콜릿 상자 2008.01.25
const cltValuesRange ItemValue_13318_ItemNum_Japan[] =
{
	// 퍼센트,		유니크,		개수,		기간.
	{ 350,		3890,			1,		0}	// 러브러브 초콜릿
	,{ 250,		3895,			1,		0}	// 우정의 초콜릿
	,{ 150,		3897,			1,		0}	// 레인보우 케이크
	,{ 100,		13606,			3,		0}	// 인첸트 망치
	,{ 100,		5365,			8,		0}	// 땅의 속성석
	,{  40,		5370,			10,		0}	// 축복의 돌
	,{  10,		2756,			2,		0}	// 네잎 클로버2
};
// [영훈] 글로벌 전용 초콜릿 상자 2008.01.29
const cltValuesRange ItemValue_13318_ItemNum_Global[] =
{
	// 퍼센트,		유니크,		개수,		기간.
	{ 350,		3890,			2,		0}	// 러브러브 초콜릿
	,{ 250,		3895,			2,		0}	// 우정의 초콜릿
	,{ 150,		3897,			1,		0}	// 레인보우 케이크
	,{ 100,		13606,			5,		0}	// 인첸트 망치
	,{ 100,		2740,			1,		0}	// 마법의 탈것 강화제
	,{  10,		5370,			5,		0}	// 축복의 돌
	,{  40,		2756,			2,		0}	// 네잎 클로버2
};

// [춘기] 발렌타인 전용 초콜릿 상자 (08.12.23)
const cltValuesRange ItemValue_13318_ItemNum[] =
{
	// 퍼센트,		유니크,		개수,		기간.
	{ 350,		3890,			2,		0}	// 러브러브 초콜릿
	,{ 250,		3895,			2,		0}	// 우정의 초콜릿
	,{ 100,		3897,			1,		0}	// 레인보우 케이크
	,{ 100,		13606,			5,		0}	// 인첸트 망치
	,{ 100,		2725,			5,		0}	// 선공방지스프
	,{  50,		12510,			1,		0}	// 소환펫 - 곰탱이 주니어
	,{  50,		2756,			1,		0}	// 네잎 클로버2
};

// [영훈] 일본 전용 캔디 상자 2008.02.18
const cltValuesRange ItemValue_13319_ItemNum_Japan[] =
{
	// 퍼센트,		유니크,		개수,		기간.
	{ 350,		3899,			1,		0}	// 사랑 캔디
	,{ 250,		3901,			1,		0}	// 우정 캔디
	,{ 150,		3897,			1,		0}	// 히시모치
	,{ 100,		13606,			3,		0}	// 미라클 뿅망치
	,{ 100,		5350,			8,		0}	// 불의 속성석
	,{  40,		5370,			10,		0}	// 축복의 돌
	,{  10,		2756,			2,		0}	// 행운의 클로버
};

// [영훈] 대만 전용 캔디 상자 2008.02.22
const cltValuesRange ItemValue_13319_ItemNum_Taiwan[] =
{
	// 퍼센트,		유니크,		개수,		기간.
	{ 350,		3899,			2,		0}	// 사랑 캔디
	,{ 250,		3901,			2,		0}	// 우정 캔디
	,{ 150,		3897,			1,		0}	// 무지개 케잌
	,{ 100,		13606,			5,		0}	// 미라클 뿅망치
	,{ 100,		2740,			1,		0}	// 마법의 탈것 강화제
	,{  10,		5370,			5,		0}	// 축복의 돌
	,{  40,		2756,			2,		0}	// 행운의 네잎 클로버

};

// [영훈] 글로벌&USA 전용 캔디 상자 2008.02.22
// 수정 - 화이트데이 전용 캔디 상자 2009.02.03
const cltValuesRange ItemValue_13319_ItemNum[] =
{
	// 퍼센트,		유니크,		개수,		기간.
	{ 350,		3901,			2,		0}	// 스타 캔디
	,{ 250,		3899,			2,		0}	// 하트 캔디
	,{ 100,		3897,			1,		0}	// 레인보우케이크
	,{ 100,		13606,			5,		0}	// 인챈트 망치
	,{ 100,		2725,			5,		0}	// 선공방지스프 (48분)
	,{  50,		12510,			1,		0}	// 소환펫 곰탱이 주니어
	,{  50,		2756,			1,		0}	// 네잎 클로버
};

const cltValuesRange ItemValue_13349_ItemNum[] =
{
	// 퍼센트,		유니크,		개수,		기간.
	{ 200,		5015,			5,		0}	// 스타 캔디
	,{ 200,		5055,			5,		0}	// 하트 캔디
	,{ 200,		5045,			5,		0}	// 레인보우케이크
	,{ 100,		2757,			1,		0}	// 인챈트 망치
	,{  40,		5355,			5,		0}	// 선공방지스프 (48분)
	,{  40,		5350,			5,		0}	// 소환펫 곰탱이 주니어
	,{  40,		5360,			5,		0}	// 네잎 클로버
	,{  40,		5365,			5,		0}	// 인챈트 망치
	,{  40,		5370,			5,		0}	// 선공방지스프 (48분)
};

// [춘기] 과금아이템 - 군주상자 2009.01.15
// [지연] '스페셜 엠플' 추가(레인보우케잌효과의 1% 확률을 줄이고 스페셜 엠플에 1% 확률을 줌) - 2009.02.26
// [춘기] 수정 : 레인보우케이크 (3897) 7% -> 6.5%로 조정, 싱크로 증가제(2791) 추가 - 2009.04.24
const cltValuesRange ItemValue_13342_ItemNum[] =
{
	// 퍼센트,		유니크,		개수,		기간.
	{ 10,		2757,			1,		0}	// EXP캡슐 (1일)
	,{ 10,		2788,			1,		0}	// 깨달음의 약 (1일)
	,{ 10,		2783,			1,		0}	// 헬라나의 극상 프리미엄 비약
	,{ 10,		2790,			1,		0}  // 스페셜 엠플
	,{ 20,		15900,			1,	   30}	// 가방
	,{ 30,		2756,			1,		0}	// Lucky FOURLEAF
	,{ 65,		3897,			1,		0}	// 레인보우 케이크
	,{ 150,		3899,			1,		0}	// 하트캔디
	,{ 150,		3890,			1,		0}	// 러브러브 초콜릿
	,{ 200,		3901,			1,		0}	// 스타 캔디
	,{ 200,		3895,			1,		0}	// 우정의 초코렛
	,{ 70,		5414,			1,		0}	// 무기 착용석
	,{ 70,		5415,			1,		0}	// 방어구 착용석
	,{  5,		2791,			1,		0}	// 싱크로 증가제
};

const cltValuesRange ItemValue_13342_ItemNum_Japan[] =
{
	// 퍼센트,		유니크,		개수,		기간.
	{   1,		12506,			1,		0},	// 포탄 소환수
	{   9,		12510,			1,		0},	// 탱이주니어
	{   8,		24030,			1,		0},	// 상태초기화이용권
	{  10,		 2783,			1,		0},	// 헬레나의 극상 프리미엄 비약
	{  15,		 2791,			1,		0},	// 싱크로 증가제
	{  20,		 2790,			1,		0},	// 특별한엠플
	{  40,		13606,		   10,		0},	// 행운의 인챈트망치
	{  60,		24099,			1,		0},	// 시장프리미엄이용권
	{  80,		 5414,			1,		0},	// 무기 착용석
	{  80,		 5415,			1,		0},	// 방어구 착용석
	{  97,		 3897,			1,		0},	// 레인보우 케이크
	{ 100,		 2756,			1,		0},	// Lucky FOURLEAF
	{ 230,		 3890,			1,		0},	// 러브러브 초콜릿
	{ 250,		 3895,			1,		0}	// 우정의 초콜릿
};
// 성웅 [중국] pc방 보상 아이템 
const cltValuesRange  ItemValue_13351_ItemNum_ChinaPcBang[] = 
{
	// 퍼센트,		유니크,		개수,		기간.
	{  5,		5350,			3,		0}	// 불속성석
	,{  5,		5355,			3,		0}	// 물속성석
	,{  5,		5360,			3,		0}	// 바람속성석
	,{  5,		5365,			3,		0}	// 땅속성석

	,{  30,		2715,			1,		0}	// 공격력 강화제
	,{  30,		2720,			1,		0}	// 방어력 강화제

	,{  60,		24000,			5,		0}	// 순간이동 이용권 
	,{  60,		7860,			2,		0}	// 수수꼐끼 소환알

	,{  70,		2705,			1,		0}	// 건강 회복약
	,{  70,		2672,			1,		0}	// 만병 통치약

	,{  80,		2585,			5,		0}	// 특급 체력 회복제
	,{  80,		2605,			5,		0}	// 특급 마력 회복제

	,{  80,		7020,			7,		0}	// 양단
	,{  80,		7040,			7,		0}	// 고급 비단
	,{  80,		3810,			7,		0}	// 닭죽
	,{  80,		3800,			7,		0}	// 잡채

	,{  90,		5040,			10,		0}	// 금광석
	,{  90,		5050,			10,		0}	// 은광석
};

// ItemUnique(7970)에서 나오는 아이템의 유니크
const SI32 siItemUnique_7930_ItemUnique[] = 
{
	ITEMUNIQUE(5350),
		ITEMUNIQUE(5355),
		ITEMUNIQUE(5360),
		ITEMUNIQUE(5365),
		ITEMUNIQUE(5370),
		ITEMUNIQUE(3855),
		ITEMUNIQUE(2725),
		ITEMUNIQUE(24045),
		ITEMUNIQUE(24020),
		ITEMUNIQUE(24075),
		ITEMUNIQUE(24000),
		ITEMUNIQUE(5000),
		ITEMUNIQUE(5010),
		ITEMUNIQUE(5015),
		ITEMUNIQUE(5017),
		ITEMUNIQUE(5020),
		ITEMUNIQUE(5025),
		ITEMUNIQUE(5030),
		ITEMUNIQUE(5040),
		ITEMUNIQUE(5045),
		ITEMUNIQUE(5050),
		ITEMUNIQUE(5055),
		ITEMUNIQUE(5056),
		ITEMUNIQUE(5057),
		ITEMUNIQUE(5060),
		ITEMUNIQUE(5065),
		ITEMUNIQUE(5070),
		ITEMUNIQUE(5075),
		ITEMUNIQUE(5080),
		ITEMUNIQUE(5090),
		ITEMUNIQUE(5100),
		ITEMUNIQUE(5200),
		ITEMUNIQUE(6050),
		ITEMUNIQUE(6100),
		ITEMUNIQUE(6105),
		ITEMUNIQUE(6110),
		ITEMUNIQUE(6115),
		ITEMUNIQUE(6120),
		ITEMUNIQUE(6130),
		ITEMUNIQUE(7000),
		ITEMUNIQUE(7010),
		ITEMUNIQUE(7020),
		ITEMUNIQUE(7030),
		ITEMUNIQUE(7040),
		ITEMUNIQUE(7050),
		ITEMUNIQUE(7060),
		ITEMUNIQUE(7070),
		ITEMUNIQUE(7080),
		ITEMUNIQUE(7090),
		ITEMUNIQUE(7100)
};

// ItemUnique(13304)에서 나오는 아이템의 유니크
//const cltUniqueRange ItemUnique_13304_ItemUnique[] = 
//{
//	{	4000,		2	}	// < 2
//	,{	4010,		2	}	// < 4
//	,{	4020,		2	}	// < 6
//	,{	4030,		2	}	// < 8
//	,{	4040,		2	}	// < 10
//	,{	4050,		2	}	// < 12
//	,{	4060,		2	}	// < 14
//	,{	4070,		2	}	// < 16
//	,{	4080,		2	}	// < 18
//	,{	4100,		6	}	// < 24
//	,{	4210,		6	}	// < 30
//	,{	4220,		6	}	// < 36
//	,{	4320,		2	}	// < 38
//	,{	4330,		6	}	// < 44
//	,{	4340,		6	}	// < 50
//	,{	4350,		6	}	// < 56
//	,{	4360,		6	}	// < 62
//	,{	4370,		6	}	// < 68
//	,{	4380,		6	}	// < 74
//	,{	4390,		2	}	// < 76
//	,{	4400,		2	}	// < 78
//	,{	4430,		6	}	// < 84
//	,{	4440,		2	}	// < 86
//	,{	4450,		2	}	// < 88
//	,{	4460,		6	}	// < 94
//	,{	4480,		6	}	// < 100
//	,{	4485,		6	}	// < 100
//};

const SI32 ItemUnique_13304_ItemUnique[] = 
{
	ITEMUNIQUE(4000),
		ITEMUNIQUE(4010),
		ITEMUNIQUE(4020),
		ITEMUNIQUE(4030),
		ITEMUNIQUE(4040),
		ITEMUNIQUE(4050),
		ITEMUNIQUE(4060),
		ITEMUNIQUE(4070),
		ITEMUNIQUE(4080),
		ITEMUNIQUE(4100),
		ITEMUNIQUE(4210),
		ITEMUNIQUE(4220),
		ITEMUNIQUE(4320),
		ITEMUNIQUE(4330),
		ITEMUNIQUE(4340),
		ITEMUNIQUE(4350),
		ITEMUNIQUE(4360),
		ITEMUNIQUE(4370),
		ITEMUNIQUE(4380),
		ITEMUNIQUE(4390),
		ITEMUNIQUE(4400),
		ITEMUNIQUE(4430),
		ITEMUNIQUE(4440),
		ITEMUNIQUE(4450),
		ITEMUNIQUE(4460),
		ITEMUNIQUE(4480),
		ITEMUNIQUE(4485)
};
const SI32 ItemUnique_13361_ItemUnique[] =	//제조 책상자
{
	ITEMUNIQUE(4010),		// 갑옷
		ITEMUNIQUE(4020),	// 투구
		ITEMUNIQUE(4030),	// 검
		ITEMUNIQUE(4040),	// 창
		ITEMUNIQUE(4050),	// 도끼
		ITEMUNIQUE(4060),	// 지팡이
		ITEMUNIQUE(4070),	// 활
		ITEMUNIQUE(4080),	// 총
		ITEMUNIQUE(4390),	// 신발
		ITEMUNIQUE(4400),	// 허리띠
};
const SI32 ItemUnique_13362_ItemUnique[] =	//기술 책상자
{
	ITEMUNIQUE(4330),		// 검술
		ITEMUNIQUE(4340),		// 창술
		ITEMUNIQUE(4350),		// 궁술
		ITEMUNIQUE(4360),		// 도끼술
		ITEMUNIQUE(4370),		// 총술
		ITEMUNIQUE(4380),		// 지팡이술
		ITEMUNIQUE(4100),		// 포획술
		ITEMUNIQUE(4430),		// 말조련술
		ITEMUNIQUE(4460),		// 소환술
};
const SI32 ItemUnique_13363_ItemUnique[] =	//생산 책 상자
{
	ITEMUNIQUE(4440),		// 철물 제조책
		ITEMUNIQUE(4450),		// 생산 도구술 책
		ITEMUNIQUE(4485),		// 결정체 제조책
		ITEMUNIQUE(4210),		// 농경술책
		ITEMUNIQUE(4220),		// 채광술책
		ITEMUNIQUE(4480),		// 어획술책
		ITEMUNIQUE(4000),		// 약제조책
		ITEMUNIQUE(4320),		// 요리술책
};


// [지연] 아바타 책상자(ItemUnique(13344))에서 나오는 아이템의 유니크
const SI32 ItemUnique_13344_ItemUnique[] = 
{
	ITEMUNIQUE(4491),	// 의복 제조책[BGN]
		ITEMUNIQUE(4496),	// 모자 제조책[BGN]
		ITEMUNIQUE(4501),	// 망토 제조책[BGN]
		ITEMUNIQUE(4506),	// 반지 제조책[BGN]
		ITEMUNIQUE(4511),	// 목걸이 제조책[BGN]
};

//[추가 : 보스 와일드 보어 이벤트 아이템 송편, 황진성 2007.9.18]
// 수수깨기 소환알
//const cltValuesRange ItemUnique_7860_Values[] = 
//{
//	{	10,		0,		10,		0	}	// < 10
//	,{	48,		10,		40,		0	}	// < 58
//	,{	29,		40,		100,	0	}	// < 87
//	,{	5,		100,	150,	0	}	// < 92
//	,{	5,		150,	160,	0	}	// < 97
//	,{	1,		160,	170,	0	}	// < 98
//	,{	1,		170,	180,	0	}	// < 99
//	,{	1,		180,	190,	0	}	// < 100
//};

// [지연] 수수께끼 소환알에서 나올 수 있는 기본 몬스터. (sortlevel 수정되면서 변경됨.)
const cltValuesRange ItemUnique_7860_Values[] = 
{
	{10,		0,		10,		0}
	,{35,		11,		58,		0}
	,{40,		59,		500,	0}
	,{8,		501,	650,	0}
	,{5,		651,	800,	0}
	,{1,		801,	900,	0}
	,{1,		901,	1000,	0}
};

// [영훈] 골든위크 이벤트시 확률 변경
//const cltValuesRange ItemUnique_7860_Values_GoldenWeek[] = 
//{
//	{	10,		0,		10,		0	}	// < 10
//	,{	39,		10,		40,		0	}	// < 49
//	,{	29,		40,		100,	0	}	// < 78
//	,{	5,		100,	150,	0	}	// < 83
//	,{	5,		150,	160,	0	}	// < 88
//	,{	10,		160,	170,	0	}	// < 98
//	,{	1,		170,	180,	0	}	// < 99
//	,{	1,		180,	190,	0	}	// < 100
//};

// ItemUnique(8115)에서 나오는 아이템의 유니크 - 가챠 복주머니
const SI32 siItemUnique_8115_ItemUnique[] = 
{
	ITEMUNIQUE(5695),
		ITEMUNIQUE(13300),
		ITEMUNIQUE(13305),
		ITEMUNIQUE(13306),
		ITEMUNIQUE(13313),
		ITEMUNIQUE(5690),
		ITEMUNIQUE(13322)
};

// ItemUnique(13337)에서 나오는 아이템의 유니크 - 가챠2 라쿤 복주머니
const SI32 siItemUnique_13337_ItemUnique[] = 
{
	ITEMUNIQUE(5685),
		ITEMUNIQUE(5690),
		ITEMUNIQUE(5695),
		ITEMUNIQUE(13305),
		ITEMUNIQUE(13306),
		ITEMUNIQUE(13300),
		ITEMUNIQUE(13322),		
		ITEMUNIQUE(13313),
		ITEMUNIQUE(13317),
		ITEMUNIQUE(13320),
		ITEMUNIQUE(13330)
};
// 대길시 주는 신행운상자에서 나오는 아이템 유니크
const cltValuesRange ItemValue_13358[] =
{
	// 퍼센트,	유니크,		개수,	기간.
	{	1,		15900,		1,		30	}	// 가방
	,{	4,		24094,		1,		0	}	// 순간이동 정기권(1일)
	,{	5,		24040,		1,		0	}	// 기술 부분 초기화 이용권
	,{	5,		13634,		1,		0	}	// 엘릭서
	,{	5,		2756,		1,		0	}	// 행운의 네잎 클로버
	,{	20,		3897,		1,		0	}	// 레인보우 케이크
	,{	30,		24117,		1,		0	}	// 소환수 보관 이용권
	,{	30,		3928,		1,		0	}	// 자연의 정수
	,{	30,		2789,		10,		0	}	// 마력의 비약	
	,{	50,		7175,		2,		0	}	// 아라미드
	,{	50,		5380,		2,		0	}	// 티타니움
	,{	50,		6140,		2,		0	}	// 마호가니
	,{	50,		24082,		2,		0	}	// 데미안 결투 신청권
	,{	50,		24084,		2,		0	}	// 흑의 군단 지령서
	,{	50,		7917,		1,		0	}	// 저주받은 운명스크롤
	,{	80,		24045,		1,		0	}	// 자막광고 이용권
	,{	80,		7860,		1,		0	}	// 수수께끼 소환알
	,{	80,		2672,		1,		0	}	// 만병통치약
	,{	80,		2585,		1,		0	}	// 특급체력회복제
	,{	80,		2605,		1,		0	}	// 특급마력회복제
	,{	70,		3911,		1,		0	}	// Turkey Dish
	,{	100,	3770,		1,		0	}	// 떡국

};

// 포춘쿠키에서 나오는 아이템 유니크
const cltValuesRange ItemValue_13063[] =
{
	// 퍼센트,	유니크,		개수,	기간.
	{	90,		-1,			1,		0	}	// 운세 (운세는 실체 없는 아이템으로 간주해 -1이 리턴되면 운세 아이템이라 약속)
	,{	9,		13062,		1,		0	}	// 쿠기조각
	,{	1,		13658,		1,		3	}	// 팅키인형[Event]

};

// 디버프(흉) 보상 아이템 유니크
const cltValuesRange ItemValue_DebuffReward[] =
{
	// 퍼센트,	유니크,		개수,	기간.
	{	20,		7917,		1,		0	}		// 저주받은 운명 스크롤
	,{	20,		7860,		1,		0	}		// 수수께끼 소환알
	,{	20,		24045,		1,		0	}		// 자막 광고이용권
	,{	20,		6100,		1,		0	}		// 닥나무
	,{	20,		5010,		1,		0	}		// 철광석
};

// 포춘쿠키 : 운세 관련
const cltValuesRange ItemValue_Fortune[] =
{
	// 운세 등급 : 대길 : 1, 길 : 2, 흉 : 3

	// 퍼센트,	운세번호,	운세등급,	텍스트유니크.
	{	20,		1,			1,			40215	}	// 
	,{	20,		2,			1,			40216	}	// 
	,{	20,		3,			1,			40217	}	// 
	,{	20,		4,			1,			40218	}	// 
	,{	20,		5,			1,			40219	}	// 무조건 적인 사랑이야 말로 진정한 기쁨을 경험하게 합니다.
	,{	25,		6,			2,			40220	}	// 
	,{	25,		7,			2,			40221	}	// 
	,{	25,		8,			2,			40222	}	// 
	,{	25,		9,			2,			40223	}	// 
	,{	25,		10,			2,			40224	}	// 받기보단 줄 수 있는 마음이 당신에게 사랑을 가져다 줄 것입니다.
	,{	25,		11,			2,			40225	}	// 
	,{	25,		12,			2,			40226	}	// 
	,{	25,		13,			2,			40227	}	// 
	,{	25,		14,			2,			40228	}	// 
	,{	25,		15,			2,			40229	}	// 
	,{	25,		16,			2,			40230	}	// 
	,{	25,		17,			2,			40231	}	// 
	,{	25,		18,			2,			40232	}	// 
	,{	25,		19,			2,			40233	}	// 
	,{	25,		20,			2,			40234	}	// 
	,{	25,		21,			2,			40235	}	// 
	,{	25,		22,			3,			40236	}	// 
	,{	25,		23,			3,			40237	}	// 
	,{	25,		24,			3,			40238	}	// 
	,{	25,		25,			3,			40239	}	// 
	,{	25,		26,			3,			40240	}	// 
	,{	25,		27,			3,			40241	}	// 
	,{	25,		28,			3,			40242	}	// 
	,{	25,		29,			3,			40243	}	// 
	,{	25,		30,			3,			40244	}	// 지금이야 말로 한층 더 열심히 일해야 할 때입니다.
	,{	25,		31,			3,			40245	}	// 
	,{	25,		32,			3,			40246	}	// 
	,{	25,		33,			3,			40247	}	// 
	,{	25,		34,			3,			40248	}	// 
	,{	25,		35,			3,			40249	}	// 
	,{	25,		36,			3,			40250	}	// 
	,{	25,		37,			3,			40251	}	// 
	,{	25,		38,			3,			40252	}	// 
	,{	25,		39,			3,			40253	}	// 
	,{	25,		40,			3,			40254	}	// 
	,{	25,		41,			3,			40255	}	//
};

// 포춘쿠키 : 흉 운세만 나오게 하기 위해 
const cltValuesRange ItemValue_UnFortune[] =
{
	// 운세 등급 : 대길 : 1, 길 : 2, 흉 : 3

	// 퍼센트, 운세번호, 운세등급, 텍스트유니크.
	{ 5,  22,   3,   40236 } // 
	,{ 5,  23,   3,   40237 } // 
	,{ 5,  24,   3,   40238 } // 
	,{ 5,  25,   3,   40239 } // 
	,{ 5,  26,   3,   40240 } // 
	,{ 5,  27,   3,   40241 } // 
	,{ 5,  28,   3,   40242 } // 
	,{ 5,  29,   3,   40243 } // 
	,{ 5,  30,   3,   40244 } // 지금이야 말로 한층 더 열심히 일해야 할 때입니다.
	,{ 5,  31,   3,   40245 } // 
	,{ 5,  32,   3,   40246 } // 
	,{ 5,  33,   3,   40247 } // 
	,{ 5,  34,   3,   40248 } // 
	,{ 5,  35,   3,   40249 } // 
	,{ 5,  36,   3,   40250 } // 
	,{ 5,  37,   3,   40251 } // 
	,{ 5,  38,   3,   40252 } // 
	,{ 5,  39,   3,   40253 } // 
	,{ 5,  40,   3,   40254 } // 
	,{ 5,  41,   3,   40255 } //
};


// 포춘쿠키 : '길' 일때 나올수 있는 버프의 종류와 확률 - 임시로 해당 이름만 들어있는 텍스트 넣었음. 
const cltValuesRange ItemValue_Fortune_Buf[] = 
{
	// 퍼센트,	버프종류,					효과수치,	버프이름유니크.
	{	3,		BUF_PREMIUMEXPUP,			0,			40284		}	// 경험치 150% "경험치"
	,{	5,		BUF_ATTACKUP,				20,			40285		}	// 공격력 20%
	,{	5,		BUF_DEFENSEUP,				20,			40286		}	// 방어력 20%
	,{	3,		BUF_MAKEEXPUP,				150,		40287		}	// 제조경험치 150%	(50이 아니라 150이 맞는지??)
	,{	3,		BUF_NOFIRSTATTACK,			0,			40288		}	// 선공방지	(몬스터에게 선공받지 않음)
	,{	5,		BUF_SUCCESS_MANUFACTURE,	0,			40289		}	// 집중총명탕	(아이템 제조 시 100% 성공)
	,{	1,		BUF_FOURLEAF,				0,			40290		}	// 네잎클로버 (아이템 획득 * 2 적용)
	,{	2,		BUF_LOVEPOWER,				0,			40291		}	// 사랑캔디 (전투/제조 경험치 150% 증가, 소환수 스테미너 방지 효과, 소환수 전투력 증가)
	,{	2,		BUF_FRIENDSHIP,				0,			40292		}	// 우정캔디 ( 전투/제조 경험치 120%, 공격력/방어력 120%증가.)
	,{	1,		BUF_HINAMOCHI,				0,			40293		}	// 레인보우 케이크 (전투/제조 경험치 200% 증가, 공격력/방어력 120%상승, 선공방지)	
	,{	8,		BUF_SUMMONATACUP,			20,			40294		}	// 소환수영양제 (소환수 공격력, 방어력 20%증가)
	,{	7,		BUF_STATUE_UP_STR,			5,			40295		}	// 근력 +5
	,{	7,		BUF_STATUE_UP_DEX,			5,			40296		}	// 순발력 +5
	,{	7,		BUF_STATUE_UP_HAND,			5,			40297		}	// 명중률 +5 (일단은 손재주로)
	,{	7,		BUF_STATUE_UP_VIT,			5,			40298		}	// 생명력 +5
	,{	7,		BUF_STATUE_UP_MAG,			5,			40299		}	// 지력 +5 (일단은 마력으로)
	,{	7,		BUF_STATUE_UP_WIS,			5,			40300		}	// 지혜 +5
	,{	10,		BUF_MAKEEXPUP,				20,			40300		}	// 제조 경험치가 20% 증가.
	,{	10,		BUF_SPEEDUP,				5,			40300		}	// 이속 최대 증가 효과.


};

// 히든 상자에서 나오는 아이템 유니크 
const cltValuesRange  ItemValue_13321[] = 
{
	// 퍼센트,		유니크,			개수,			기간.
	{   50,		2765,				1,				0 }	
	,{   5,		2715,				2,				0 }	
	,{   5,		2720,				2,				0 }	
	,{   5,		2757,				1,				0 }	
	,{   5,		3880,				3,				0 }
	,{   5,		5600,				1,				0 }	
	,{   5,		2745,				1,				0 }
	,{   10,	2756,				2,				0 }
	,{   10,	7860,				10,				0 }	

};
// 보물찾기 낡은 쇠뭉치
const cltValuesRange  ItemValue_13347[] = 
{
	// 퍼센트,		유니크,			개수,			기간.
	{   20,		5020,				1,				0 }	
	,{   20,	5010,				1,				0 }	
	,{   15,	5050,				1,				0 }	
	,{   15,	5040,				1,				0 }	
	,{   5,		13051,				1,				0 }
	,{   5,		13052,				1,				0 }	
	,{   5,		13053,				1,				0 }
	,{   5,		13054,				1,				0 }
	,{   5,		13055,				1,				0 }	
	,{   5,		13056,				1,				0 }	

};

// '보물 상자'에서 나오는 아이템
const SI32 siItemUnique_13314_ItemUnique[]=
{
	ITEMUNIQUE(5015),
		ITEMUNIQUE(5045),
		ITEMUNIQUE(5055),
		ITEMUNIQUE(5017),
		ITEMUNIQUE(5350),
		ITEMUNIQUE(5355),
		ITEMUNIQUE(5360),
		ITEMUNIQUE(5365),
		ITEMUNIQUE(5370),
		ITEMUNIQUE(5375)
};

// '선물상자'에서 나오는 아이템
const cltValuesRange siItemUnique_13360_ItemUnique[] =
{
	// 퍼센트,		유니크,		개수,		기간.
	 { 150,			3790,			10,		0}	// 소갈비
	,{ 150,			2585,			10,		0}	// 특급 체력 회복제
	,{ 150,			2605,			10,		0}	// 특급 마력 회복제
	,{ 150,			13042,			3,		0}	// 폭죽
	,{ 100,			2799,			1,		0}	// GE 공격력 강화제
	,{ 100,			2800,			1,		0}	// GE 방어력 강화제
	,{ 100,			2797,			1,		0}	// GE 선공방지스프
	,{ 100,			2690,			1,		0}	// 헬레나의 성장 비약
};

// '재료 상자'에서 나오는 아이템
const SI32 siItemUnique_13315_ItemUnique[]=
{
	ITEMUNIQUE(2016),
		ITEMUNIQUE(2017),
		ITEMUNIQUE(5000),
		ITEMUNIQUE(5010),
		ITEMUNIQUE(5030),
		ITEMUNIQUE(5040),
		ITEMUNIQUE(5050),
		ITEMUNIQUE(7000),
		ITEMUNIQUE(7020),
		ITEMUNIQUE(7070)
};

// '키메라 상자'에서 나오는 아이템 - 중국용
const SI32 siItemUnique_13302_ItemUnique_China[]=
{
	ITEMUNIQUE(2000),
		ITEMUNIQUE(2002),
		ITEMUNIQUE(2004),
		ITEMUNIQUE(2006),
		ITEMUNIQUE(2010),
		ITEMUNIQUE(2012),
		ITEMUNIQUE(2014),
		ITEMUNIQUE(2015),
		ITEMUNIQUE(2016),
		ITEMUNIQUE(2017),
		ITEMUNIQUE(2020),
		ITEMUNIQUE(2030),
		ITEMUNIQUE(5000),
		ITEMUNIQUE(5010),
		ITEMUNIQUE(5020),
		ITEMUNIQUE(5030),
		ITEMUNIQUE(5040),
		ITEMUNIQUE(5050)
};

// '키메라 상자'에서 나오는 아이템 - 글로벌용
const SI32 siItemUnique_13302_ItemUnique_English[]=
{
	ITEMUNIQUE(2000),
		ITEMUNIQUE(2002),
		ITEMUNIQUE(2004),
		ITEMUNIQUE(2006),
		ITEMUNIQUE(2010),
		ITEMUNIQUE(2012),
		ITEMUNIQUE(2014),
		ITEMUNIQUE(2015),
		ITEMUNIQUE(2016),
		ITEMUNIQUE(2017),
		ITEMUNIQUE(2020),
		ITEMUNIQUE(2030),
		ITEMUNIQUE(5000),
		ITEMUNIQUE(5010),
		ITEMUNIQUE(5020),
		ITEMUNIQUE(5030),
		ITEMUNIQUE(5040),
		ITEMUNIQUE(5050),
		ITEMUNIQUE(7917),
		ITEMUNIQUE(7917),
		ITEMUNIQUE(7917),
		ITEMUNIQUE(7917),
		ITEMUNIQUE(7917)
};
// '키메라 상자'에서 나오는 아이템 - NHNChina용
const SI32 siItemUnique_13302_ItemUnique_NHNChina[]=
{
	ITEMUNIQUE(2000),
		ITEMUNIQUE(2002),
		ITEMUNIQUE(2004),
		ITEMUNIQUE(2006),
		ITEMUNIQUE(2010),
		ITEMUNIQUE(2012),
		ITEMUNIQUE(2014),
		ITEMUNIQUE(2015),
		ITEMUNIQUE(2016),
		ITEMUNIQUE(2017),
		ITEMUNIQUE(2020),
		ITEMUNIQUE(2030),
		ITEMUNIQUE(5000),
		ITEMUNIQUE(5010),
		ITEMUNIQUE(5020),
		ITEMUNIQUE(5030),
		ITEMUNIQUE(5040),
		ITEMUNIQUE(5050),
		ITEMUNIQUE(7917),
		ITEMUNIQUE(7917),
		ITEMUNIQUE(7917),
		ITEMUNIQUE(7917),
		ITEMUNIQUE(7917)
};

// '키메라 상자'에서 나오는 아이템 - 일본용
const SI32 siItemUnique_13302_ItemUnique_Japan[]=
{
	ITEMUNIQUE(2000),
		ITEMUNIQUE(2002),
		ITEMUNIQUE(2004),
		ITEMUNIQUE(2006),
		ITEMUNIQUE(2010),
		ITEMUNIQUE(2012),
		ITEMUNIQUE(2014),
		ITEMUNIQUE(2015),
		ITEMUNIQUE(2016),
		ITEMUNIQUE(2017),
		ITEMUNIQUE(2020),
		ITEMUNIQUE(2030),
		ITEMUNIQUE(5000),
		ITEMUNIQUE(5010),
		ITEMUNIQUE(5020),
		ITEMUNIQUE(5030),
		ITEMUNIQUE(5040),
		ITEMUNIQUE(5050),
		ITEMUNIQUE(7917),
		ITEMUNIQUE(7917),
		ITEMUNIQUE(7917),
		ITEMUNIQUE(7917),
		ITEMUNIQUE(7917)
};
// '키메라 상자'에서 나오는 아이템 - 스패셜
const SI32 siItemUnique_13302_ItemUnique_Korea[]=
{
	ITEMUNIQUE(2000),
		ITEMUNIQUE(2002),
		ITEMUNIQUE(2004),
		ITEMUNIQUE(2006),
		ITEMUNIQUE(2010),
		ITEMUNIQUE(2012),
		ITEMUNIQUE(2014),
		ITEMUNIQUE(2015),
		ITEMUNIQUE(2016),
		ITEMUNIQUE(2017),
		ITEMUNIQUE(2020),
		ITEMUNIQUE(2030),
		ITEMUNIQUE(5000),
		ITEMUNIQUE(5010),
		ITEMUNIQUE(5020),
		ITEMUNIQUE(5030),
		ITEMUNIQUE(5040),
		ITEMUNIQUE(5050),
		ITEMUNIQUE(7917),
		ITEMUNIQUE(7917),
		ITEMUNIQUE(7917),
		ITEMUNIQUE(7917),
		ITEMUNIQUE(7917),
		ITEMUNIQUE(13026)
};

// '키메라 상자'에서 나오는 아이템 - 유럽용
const SI32 siItemUnique_13302_ItemUnique_Europe[]=
{
	ITEMUNIQUE(2000),
		ITEMUNIQUE(2002),
		ITEMUNIQUE(2004),
		ITEMUNIQUE(2006),
		ITEMUNIQUE(2010),
		ITEMUNIQUE(2012),
		ITEMUNIQUE(2014),
		ITEMUNIQUE(2015),
		ITEMUNIQUE(2016),
		ITEMUNIQUE(2017),
		ITEMUNIQUE(2020),
		ITEMUNIQUE(2030),
		ITEMUNIQUE(5000),
		ITEMUNIQUE(5010),
		ITEMUNIQUE(5020),
		ITEMUNIQUE(5030),
		ITEMUNIQUE(5040),
		ITEMUNIQUE(5050),
		ITEMUNIQUE(7917),
		ITEMUNIQUE(7917),
		ITEMUNIQUE(7917),
		ITEMUNIQUE(7917),
		ITEMUNIQUE(7917)
};


// '키메라 상자'에서 나오는 아이템 - 기타
const SI32 siItemUnique_13302_ItemUnique_Etc[]=
{
	ITEMUNIQUE(2000),
		ITEMUNIQUE(2002),
		ITEMUNIQUE(2004),
		ITEMUNIQUE(2006),
		ITEMUNIQUE(2010),
		ITEMUNIQUE(2012),
		ITEMUNIQUE(2014),
		ITEMUNIQUE(2015),
		ITEMUNIQUE(2016),
		ITEMUNIQUE(2017),
		ITEMUNIQUE(2020),
		ITEMUNIQUE(2030),
		ITEMUNIQUE(5000),
		ITEMUNIQUE(5010),
		ITEMUNIQUE(5020),
		ITEMUNIQUE(5030),
		ITEMUNIQUE(5040),
		ITEMUNIQUE(5050),
		ITEMUNIQUE(7917),
		ITEMUNIQUE(7917),
		ITEMUNIQUE(7917),
		ITEMUNIQUE(7917),
		ITEMUNIQUE(7917) // 비밀열쇠가 나올 확률이 약 33%
};

// '대박상자'에서 나오는 아이템 - 기타
const SI32 siItemUnique_13325_ItemUnique[] =
{
	ITEMUNIQUE(5350),
		ITEMUNIQUE(5355),
		ITEMUNIQUE(5360),
		ITEMUNIQUE(5365),
		ITEMUNIQUE(5370),
		ITEMUNIQUE(5410),
		ITEMUNIQUE(1803)
};

// "대박상자" 등급 확률
const cltUniqueRange ItemUnique_8113_Grade[] = 
{
	//등급,    확률
	{	1,		 4	}	// < 5
	,{	2,		30	}	// < 35
	,{	3,		66	}	// < 100
};

// "대박상자" 등급 확률
const cltUniqueRange ItemUnique_13621_Grade[] = 
{
	//등급,    확률
	{	1,		20	}	// < 20
	,{	2,		60	}	// < 80
	,{	3,		20	}	// < 100
};

// "대박상자"에서 나오는 아이템 유니크 
/*const cltValuesRange  BigItemBox_1_Grade[] = 
{
	// 퍼센트,		유니크,			개수,			기간.
	{   5,		5350,				1,				0 }	
	,{   5,		5355,				1,				0 }	
	,{   5,		5360,				1,				0 }	
	,{   5,		5365,				1,				0 }	
	,{   5,		5370,				1,				0 }
	,{   5,		5410,				1,				0 }	
	,{   5,		2757,				1,				0 }
	,{   5,		5400,				1,				0 }
	,{   4,		3890,				1,				0 }	
	,{   4,		3899,				1,				0 }	
	,{   3,		5600,				1,				0 }	
	,{  10,		24111,				1,				0 }	
	,{   3,		2740,				1,				0 }	
	,{   9,		2756,				1,				0 }	
	,{   8,		2710,				1,				0 }	
	,{   5,		24040,				1,				0 }	
	,{   5,		24094,				1,				0 }	
	,{   1,		15900,				1,			   30 }	
	,{   1,		13621,				1,				0 }	
	,{   1,		24098,				1,				0 }	
	,{   1,		2760,				1,				0 }	
	,{   1,		5710,				1,				0 }	
	,{   1,		5715,				1,				0 }	
	,{   1,		1803,				1,				0 }	
	,{   1,		5412,				1,				0 }	
	,{   1,		1801,				1,				0 }	
};
*/



// "대박상자"에서 나오는 아이템 유니크 
const cltValuesRange  BigItemBox_3_Grade[] = 
{
	// 퍼센트,		유니크,			개수,			기간.
	{  10,		24082,				 1,				0 }	
	,{   1,		2700,				10,				0 }	
	,{   1,		2630,				10,				0 }	
	,{  10,		24107,				 1,				0 }	
	,{   1,		24015,				10,				0 }	
	,{   3,		13621,				 1,				0 }
	,{   5,		5015,				10,				0 }	
	,{   5,		5045,				10,				0 }
	,{   5,		5055,				10,				0 }
	,{   5,		7020,				10,				0 }	
	,{   2,		7185,				10,				0 }	
	,{   5,		6110,				10,				0 }	
	,{   2,		6115,				10,				0 }	
	,{   5,		2016,				10,				0 }	
	,{   5,		2017,				10,				0 }	
	,{   2,		7180,				10,				0 }	
	,{   5,		3620,				10,				0 }	
	,{   5,		3660,				10,				0 }	
	,{   5,		2000,				10,				0 }	
	,{   5,		5075,				10,				0 }	
	,{   5,		24047,				10,				0 }	
	,{   5,		24000,				10,				0 }	
	,{   2,		7860,				10,				0 }	
	,{   1,		5375,				10,				0 }	
};

// [강형] 대박상자(농경) -> [진성] 낚시이벤트. 낡은상자로 변경. 사용하지 않아서.. 2008-8-12 -> [영훈] 아이템/확률 변경
const cltValuesRange  ItemValue_13326_ItemNum[] = 
{
	// 퍼센트,		유니크,		개수,	기간.
	{	1000,		24118,		1,		0}	// 낚시 추첨 티켓
	,{	 900,		5045,		5,		0}	// 금괴
	,{	 900,		5055,		5,		0}	// 은괴
	,{	 900,		5380,		5,		0}	// 티타니움
	,{	 900,		5375,		5,		0}	// 검은돌 조각
	,{	 900,		6140,		5,		0}	// 검은돌 조각
	,{	 300,		2756,		1,		0}	// 행운의 네잎 클로버
	,{	 400,		3899,		1,		0}	// 하트캔디
	,{	 400,		3901,		1,		0}	// 스타캔디
	,{	 400,		3890,		1,		0}	// 러브러브 초콜릿
	,{	 400,		3895,		1,		0}	// 우정의 초콜릿
	,{	 400,		3897,		1,		0}	// 레인보우 케이크
	,{	 900,		3885,		1,		0}	// 김밥
	,{	   5,		24070,		1,		0}	// 캐릭터 변경 이용권
	,{	 100,		2674,		1,		0}	// 설사약
	,{	 100,		2672,		1,		0}	// 만병통치약
	,{	 100,		2725,		1,		0}	// 선공방지 스프
	,{	  20,		2745,		1,		0}	// 제조총명탕
	,{	 100,		2710,		1,		0}	// 소환수 스테미너약
	,{	  20,		24040,		1,		0}	// 기술부분초기화이용권
	,{	  44,		13606,		1,		0}	// 행운의 인챈트 망치
	,{	  40,		13607,		1,		0}	// 인챈트 밀봉못
	,{	 100,		2715,		1,		0}	// 공격력 강화제
	,{	 100,		2720,		1,		0}	// 방어력 강화제
	,{	  10,		15900,		1,		0}	// 가방
	,{	  40,		5400,		1,		0}	// 기간 연장의 돌
	,{	  20,		2740,		1,		0}	// 마법의 탈것 강화제
	,{	   1,		24030,		1,		0}	// 상태초기화이용권
	,{	 100,		24020,		1,		0}	// 소환수 부활의 돌
	,{	 100,		5355,		1,		0}	// 물 속성석
	,{	 100,		5360,		1,		0}	// 바람 속성석
	,{	 100,		5365,		1,		0}	// 땅 속성석
	,{	 100,		5350,		1,		0}	// 불 속성석

};

const cltValuesRange  ItemValue_13326_ItemNum_Japan[] = 
{
	// 퍼센트,		유니크,		개수,	기간.
	{	1000,		24118,		1,		0}	// 낚시 추첨 티켓
	,{	 900,		5045,		5,		0}	// 금괴
	,{	 900,		5055,		5,		0}	// 은괴
	,{	 900,		16010,		5,		0}	// 
	,{	 900,		6110,		5,		0}	//
	,{	 900,		7020,		5,		0}	// 검은돌 조각
	,{	 300,		2756,		1,		0}	// 행운의 네잎 클로버
	,{	 400,		3899,		1,		0}	// 하트캔디
	,{	 400,		3901,		1,		0}	// 스타캔디
	,{	 400,		3890,		1,		0}	// 러브러브 초콜릿
	,{	 400,		3895,		1,		0}	// 우정의 초콜릿
	,{	 400,		3897,		1,		0}	// 레인보우 케이크
	,{	 900,		2674,		1,		0}	// 김밥
	,{	   5,		5414,		1,		0}	// 캐릭터 변경 이용권
	,{	 100,		3885,		1,		0}	// 설사약
	,{	 100,		2672,		1,		0}	// 만병통치약
	,{	 100,		2725,		1,		0}	// 선공방지 스프
	,{	  20,		5380,		1,		0}	// 제조총명탕
	,{	 100,		2710,		1,		0}	// 소환수 스테미너약
	,{	  20,		6140,		1,		0}	// 기술부분초기화이용권
	,{	  44,		13606,		1,		0}	// 행운의 인챈트 망치
	,{	  40,		5375,		1,		0}	// 인챈트 밀봉못
	,{	 100,		2715,		1,		0}	// 공격력 강화제
	,{	 100,		2720,		1,		0}	// 방어력 강화제
	,{	  10,		24082,		1,		0}	// 
	,{	  40,		5370,		1,		0}	// 기간 연장의 돌
	,{	  20,		7175,		1,		0}	// 
	,{	   1,		15900,		1,		0}	// 
	,{	 100,		24020,		1,		0}	// 소환수 부활의 돌
	,{	 100,		5355,		1,		0}	// 물 속성석
	,{	 100,		5360,		1,		0}	// 바람 속성석
	,{	 100,		5365,		1,		0}	// 땅 속성석
	,{	 100,		5350,		1,		0}	// 불 속성석
};

// [강형] 대박상자(채광)
const cltValuesRange  ItemValue_13327_ItemNum[] = 
{
	// 퍼센트,		유니크,		개수,		기간.
	{  1,		5600,			1,		0}	// 
	,{  1,		5620,			1,		0}	// 
	,{  2,		15910,			1,		0}	// 
	,{  1,		24096,			1,		0}	// 
	,{  5,		3919,			1,		0}	// 
	,{  5,		5400,			1,		0}	// 
	,{  5,		2757,			1,		0}	// 
	,{  5,		2756,			1,		0}	// 
	,{  5,		24047,			10,		0}	// 
	,{  5,		2781,			3,		0}	// 
	,{  5,		2782,			3,		0}	// 
	,{  5,		2715,			3,		0}	// 
	,{  5,		2720,			3,		0}	// 
	,{  10,		5350,			1,		0}	// 
	,{  10,		5355,			1,		0}	// 
	,{  10,		5360,			1,		0}	// 
	,{  10,		5365,			1,		0}	// 
	,{  10,		5370,			1,		0}	// 
};

// [강형] 상어(낚시)
const cltValuesRange  ItemValue_13328_ItemNum[] = 
{
	// 퍼센트,		유니크,		개수,		기간.
	{  1,		5600,			1,		0}	// 
	,{  1,		5620,			1,		0}	// 
	,{  2,		15910,			1,		0}	// 
	,{  1,		24096,			1,		0}	// 
	,{  5,		24047,			10,		0}	// 
	,{  5,		5400,			1,		0}	// 
	,{  5,		2757,			1,		0}	// 
	,{  5,		2756,			1,		0}	// 
	,{  5,		5375,			10,		0}	// 
	,{  5,		2781,			3,		0}	// 
	,{  5,		2782,			3,		0}	// 
	,{  5,		2715,			3,		0}	// 
	,{  5,		2720,			3,		0}	// 
	,{  10,		5350,			1,		0}	// 
	,{  10,		5355,			1,		0}	// 
	,{  10,		5360,			1,		0}	// 
	,{  10,		5365,			1,		0}	// 
	,{  10,		5370,			1,		0}	// 
};

// [희영] 라쿤 가죽 지갑 - 
const cltValuesRange  ItemValue_13333_ItemNum[] = 
{
	// 퍼센트,		유니크,		최소개수,		최대개수
	{  150,		2016,			5,		10}	// 
	,{  150,		2000,			5,		10}	// 
	,{  150,		2012,			5,		10}	// 
	,{  150,		2010,			5,		10}	// 콩뿌리
	,{  80,		5015,			5,		10}	// 철괴
	,{  80,		5055,			5,		10}	// 은괴
	,{  80,		5045,			5,		10}	// 금괴
	,{  20,		5380,			1,		5}	// 
	,{  20,		6140,			1,		5}	// 
	,{  20,		7175,			1,		5}	// 아라미드 
	,{  20,		2710,			2,		5}	// 소환수 스테미너약
	,{  20,		2735,			2,		5}	// 소환수 영양제
	,{  13,		13625,			1,		2}	// 
	,{  20,		5414,			1,		2}	// 
	,{  20,		5415,			1,		2}	// 
	,{  5,		12531,			1,		1}	// 
	,{  2,		5748,			1,		1}	// 
};

// [진성] 루미너리(USA) 1주년 기념 과금 상자  => 2008-9-25
const cltValuesRange  ItemValue_13335_ItemNum[] = 
{
	// 퍼센트,		유니크,		최소개수,		?
	{   3,		 5695,		1,		0}	// 
	,{   3,		13305,		1,		0}	// 
	,{   3,		13306,		1,		0}	// 
	,{   3,		 5690,		1,		0}	// 
	,{   3,	    13317,		1,		0}	// 
	,{   3,		 5685,		1,		0}	// 
	,{   3,		13320,		1,		0}	// 
	,{   3,		13330,		1,		0}	// 
	,{  10,		15916,		1,		0}	// 
	,{   1,		12506,		1,		0}	// 
	,{  60,		 2757,		1,		0}	// 
	,{  60,		24111,		1,		0}	// 
	,{  50,		13625,		2,		0}	// 
	,{  50,		 2715,		1,		0}	// 
	,{  50,		 2720,		1,		0}	// 
	,{  50,		 3897,		1,		0}	// 
	,{  60,		 3901,	 	1,		0}	// 
	,{  70,		13607,		1,		0}	// 
	,{  50,		13606,		3,		0}	// 
	,{  75,		 7860,	   10,		0}	// 
	,{  20,		 5410,		1,		0}	// 
	,{  60,		 5400,		2,		0}	// 
	,{  50,		13600,		1,		0}	// 
	,{  50,		13601,		1,		0}	// 
	,{  50,		24040,		1,		0}	// 
	,{  50,		 5414,		1,		0}	// 
	,{  50,		 5415,		1,		0}	// 
	,{  60,		24020,	   10,		0}	// 
};

#endif
