//=============================================================================
//
//	CryptTool.h
//
//	Copyright 2005 HQGame
//
//=============================================================================
#ifndef _CRYPTTOOL_H_
#define _CRYPTTOOL_H_

#pragma once

#ifndef __AFXWIN_H__
#error PCH에서 이 파일을 포함하기 전에 'stdafx.h'를 포함하십시오.
#endif // __AFXWIN_H__

#include "resource.h"		// 주 기호

//=============================================================================
//	CLASS   CCryptToolApp
//! @brief  CWinApp
//=============================================================================
class CCryptToolApp : public CWinApp
{
public:
	CCryptToolApp();

public:
	//=============================================================================
	// 재정의
	//=============================================================================
	virtual BOOL InitInstance();

	DECLARE_MESSAGE_MAP()
};

//=============================================================================
// Global Variable
//=============================================================================
extern CCryptToolApp theApp;

#endif // _CRYPTTOOL_H_ 

