//=============================================================================
//
//	ViewerDialog.h
//
//	Copyright 2005 HQGame
//
//=============================================================================
#ifndef _VIEWERDIALOG_H_
#define _VIEWERDIALOG_H_

#pragma once
#include "afxwin.h"

//=============================================================================
//	CLASS   CViewerDialog
//! @brief  CViewerDialog 대화 상자입니다.
//=============================================================================
class CViewerDialog : public CDialog
{
	DECLARE_DYNAMIC(CViewerDialog)

public:
	CViewerDialog(CWnd* pParent = NULL);   // 표준 생성자입니다.
	virtual ~CViewerDialog();

	//=============================================================================
	// 대화 상자 데이터입니다.
	enum { IDD = IDD_VIEWER };
	//=============================================================================

protected:
	virtual void DoDataExchange(CDataExchange* pDX);    // DDX/DDV 지원입니다.

	//=============================================================================
	// 메시지 맵 함수를 생성했습니다.
	virtual BOOL OnInitDialog();
	virtual void OnSize(UINT nType, int cx, int cy);
	DECLARE_MESSAGE_MAP()
	//=============================================================================

public:
	//=============================================================================
	// 컨트롤 변수
	//=============================================================================
	CEdit m_edtViewer;

	//=============================================================================
	// CEdit 컨트롤과 연결된 변수
	//=============================================================================
	CString m_strViewer;
	
};

#endif

